import { z } from 'zod'

export const ChangePasswordFormValidation = z
  .object({
    oldPassword: z.string().min(6, 'رمز عبور فعلی باید حداقل 6 کاراکتر باشد.'),
    // .regex(/[a-z]/, 'رمز عبور فعلی باید حداقل یک حرف کوچک داشته باشد.')
    // .regex(/[A-Z]/, 'رمز عبور فعلی باید حداقل یک حرف بزرگ داشته باشد.')
    // .regex(/\d/, 'رمز عبور فعلی باید حداقل یک عدد داشته باشد.'),
    newPassword: z.string().min(6, 'رمز عبور جدید باید حداقل 6 کاراکتر باشد.'),
    // .regex(/[a-z]/, 'رمز عبور جدید باید حداقل یک حرف کوچک داشته باشد.')
    // .regex(/[A-Z]/, 'رمز عبور جدید باید حداقل یک حرف بزرگ داشته باشد.')
    // .regex(/\d/, 'رمز عبور جدید باید حداقل یک عدد داشته باشد.'),
    confirmPassword: z.string().min(6, 'تکرار رمز عبور جدید باید حداقل 6 کاراکتر باشد.'),
    // .regex(/[a-z]/, 'تکرار رمز عبور جدید باید حداقل یک حرف کوچک داشته باشد.')
    // .regex(/[A-Z]/, 'تکرار رمز عبور جدید باید حداقل یک حرف بزرگ داشته باشد.')
    // .regex(/\d/, 'تکرار رمز عبور جدید باید حداقل یک عدد داشته باشد.'),
  })
  .refine((data) => data.newPassword === data.confirmPassword, {
    message: 'رمز عبور جدید و تکرار آن باید یکسان باشند.',
    path: ['confirmPassword'], // خطا در فیلد confirmPassword نمایش داده می‌شود
  })
