import React from 'react'

import AngleLeftIcon from '@/components/icons/AngleLeftIcon'
import Accordion from '@/components/ui/Accordion'
import IntroHeader from '@/components/ui/IntroHeader'

const Questions = () => {
  const questions = [
    {
      id: 1,
      key: '1',
      title: '1. شبیه‌سازی شغلی OBS  چگونه کار می‌کند؟',
      content:
        'شبیه‌سازی شغلی OBS  از رویکرد آموزشی جذابی برای فضاسازی متنی محیط کار و ارائه ی ماموریت های کاری واقعی برای ایجاد محیط‌های کاری واقع‌گرایانه استفاده می‌کند. کاربران می‌توانند در این محیط‌ها وظایف مختلف شغلی را تجربه کنند، که این امر به کارفرمایان کمک می‌کند تا توانایی‌ها و سازگاری کاندیداها با شغل مورد نظر را ارزیابی کنند.',
    },
    {
      id: 2,
      key: '2',
      title: '2. چه نوع شغل‌هایی می‌توانند از شبیه‌سازی شغلی OBS  استفاده کنند؟',
      content:
        'پلتفرم OBS  برای طیف وسیعی از شغل‌ها قابل استفاده است، از جمله مشاغل فنی، مدیریتی، خدماتی و حتی خلاقانه. این پلتفرم انعطاف‌پذیر است و می‌توان آن را برای شبیه‌سازی شرایط کاری خاص هر شغلی تنظیم کرد.',
    },
    {
      id: 3,
      key: '3',
      title: '3. استفاده از OBS  چه مزایایی برای کسب‌وکارها دارد؟',
      content: `<p>استفاده از OBS به کسب‌وکارها کمک می‌کند تا:</p>
<ul class="mr-4 list-disc list-inside">
    <li>هزینه‌های استخدام و آموزش را کاهش دهند.</li>
    <li>کیفیت استخدام را افزایش دهند.</li>
    <li>نرخ ترک شغل را کاهش دهند.</li>
    <li>رضایت و وفاداری کارمندان را افزایش دهند.</li>
    <li>استعدادهای برتر را جذب و حفظ کنند.</li>
</ul>`,
    },
    {
      id: 4,
      key: '4',
      title: '4. آیا OBS  برای شرکت‌های کوچک و متوسط نیز مناسب است؟',
      content:
        'بله، OBS  برای شرکت‌های با اندازه‌های مختلف، از کوچک تا بزرگ، طراحی شده است. این پلتفرم دارای بسته‌های مختلفی است که می‌توانند به نیازها و بودجه‌های متفاوت سازمان‌ها پاسخ دهند.',
    },
    {
      id: 5,
      key: '5',
      title: '5. چگونه می‌توانم از OBS  برای کسب‌وکار خود استفاده کنم؟',
      content:
        'برای شروع استفاده از OBS ، به وب‌سایت رسمی ما مراجعه کنید و ثبت‌نام کنید. شما می‌توانید شبیه سازهای موجود را تجربه کنید و با ثبت سفارش، از خدمات  تیم ما برای ایجاد شبیه ساز شغلی اختصاصی شما و استفاده از پلتفرم استفاده کنید. همچنین، ما پشتیبانی فنی و آموزش‌های لازم را برای تضمین موفقیت شما در استفاده از این ابزار ارائه می‌دهیم.',
    },
    {
      id: 6,
      key: '6',
      title: '6. آیا OBS  به زبان‌های مختلف در دسترس است؟',
      content: 'خیر، پلتفرم OBS  درحال حاضر صرفا خدمات شبیه سازی مشاغل ایرانی و بین المللی را به زبان فارسی ارائه می دهد.',
    },
    {
      id: 7,
      key: '7',
      title: '7. چگونه می‌توانم اطمینان حاصل کنم که شبیه‌سازی‌های شغلی OBS  واقع‌بینانه هستند؟',
      content:
        'پلتفرم OBS  با استفاده از داده‌های واقعی شغلی و بازخوردهای کارشناسان صنعت برای ایجاد شبیه‌سازی‌های دقیق و واقع‌بینانه توسعه یافته است. همچنین، ما به طور مداوم شبیه‌سازی‌ها را بر اساس بازخوردهای کاربران و تغییرات در الزامات شغلی به‌روزرسانی می‌کنیم.',
    },
    {
      id: 8,
      key: '8',
      title: '8. آیا OBS  داده‌های کاربران را ایمن نگه می‌دارد؟',
      content:
        'امنیت داده‌ها برای ما اولویت بالایی دارد. OBS  صرفا اطلاعات و داده هایی که کاربران انتخاب می کنند را در اختیار کسب و کارها قرار می دهد.',
    },
    {
      id: 9,
      key: '9',
      title: '9. چه پشتیبانی‌هایی برای کاربران OBS  وجود دارد؟',
      content:
        'ما در OBS  به ارائه پشتیبانی عالی به کاربران خود افتخار می‌کنیم. تیم پشتیبانی ما شامل متخصصان منابع انسانی و فناوری است که آماده پاسخگویی به سوالات و حل مشکلات احتمالی کاربران در هر زمان هستند. کاربران می‌توانند از طریق تلفن، ایمیل یا شبکه های اجتماعی با ما در تماس باشند.',
    },
    {
      id: 10,
      key: '10',
      title: '10. چگونه می‌توانم نتایج استفاده از OBS  را ارزیابی کنم؟',
      content:
        'OBS  دارای ابزارهای تحلیلی پیشرفته است که به کاربران امکان می‌دهد تأثیر استفاده از شبیه‌سازی شغلی را بر کسب‌وکار خود ارزیابی کنند. شما می‌توانید گزارش‌های دقیقی در مورد عملکرد کاندیداها، نرخ ترک شغل، و سایر معیارهای کلیدی دریافت کنید تا بتوانید تصمیم‌گیری‌های آگاهانه‌تری داشته باشید.',
    },
    {
      id: 11,
      key: '11',
      title: '11. آیا OBS  قابلیت تطبیق با نیازهای خاص کسب‌وکار من را دارد؟',
      content:
        'بله، پلتفرم OBS  به گونه‌ای طراحی شده است که بتواند به صورت انعطاف‌پذیر با نیازهای خاص هر کسب‌وکار تطبیق یابد. شما می‌توانید شبیه‌سازی‌ها را بر اساس نیازهای خاص محیط کاری، مهارت‌های مورد نظر، و حتی فرهنگ سازمانی خود سفارشی‌سازی کنید.',
    },
    {
      id: 12,
      key: '12',
      title: '12. چه تضمینی وجود دارد که OBS  به بهبود فرآیندهای استخدامی کمک می‌کند؟',
      content:
        'ما در OBS  با ارائه داده‌های مبتنی بر نتایج و مطالعات موردی که به طور مستقیم تأثیر مثبت شبیه‌سازی شغلی را نشان می‌دهند، به مشتریان خود اطمینان می‌دهیم. بسیاری از کسب‌وکارها با استفاده از OBS  توانسته‌اند کیفیت استخدام‌های خود را بهبود ببخشند و هزینه‌های مرتبط با استخدام و آموزش را کاهش دهند.',
    },
    {
      id: 13,
      key: '13',
      title: '13. آیا OBS  مناسب برای کسب‌وکارهای در حال رشد است؟',
      content:
        'بله، OBS  به ویژه برای کسب‌وکارهای در حال رشد که به دنبال تسریع فرآیندهای استخدام و کاهش ریسک‌های مرتبط با استخدام نیروی جدید هستند، ایده‌آل است. این پلتفرم به آن‌ها امکان می‌دهد تا سریع‌تر و با اطمینان بیشتری نیروهای خود را گسترش دهند.',
    },
    {
      id: 14,
      key: '14',
      title: '14. چگونه می‌توانم به جامعه کاربران OBS  ملحق شوم؟',
      content:
        'برای پیوستن به جامعه کاربران  OBS ، شما می‌توانید به وب‌سایت ما مراجعه کرده و ثبت‌نام کنید. همچنین، می‌توانید در شبکه های اجتماعی ما را دنبال کرده و تجربیات خود را با سایر کاربران به اشتراک بگذارید و از تجربیات آن‌ها بهره‌مند شوید.',
    },
    {
      id: 15,
      key: '15',
      title: '15. آیا OBS  دوره‌های آموزشی یا وبینارهایی برای کمک به کاربران جدید ارائه می‌دهد؟',
      content:
        'بله، ما در OBS  به طور منظم وبینارها و دوره‌های آموزشی را زیر مجموعه ی آکادمی نیتک برگزار می‌کنیم تا کاربران جدید بتوانند به طور مؤثر از پلتفرم استفاده کنند. این دوره‌ها شامل آموزش‌های گام به گام برای راه‌اندازی و استفاده از شبیه‌سازی‌ها، به همراه نکات و ترفندهایی برای بهینه‌سازی فرآیندهای استخدامی هستند.',
    },
    {
      id: 16,
      key: '16',
      title: '16. چگونه OBS  می‌تواند به ما کمک کند تا استعدادهای پنهان را کشف کنیم؟',
      content:
        'OBS  با ارائه شبیه‌سازی‌های دقیق و واقع‌گرایانه، به کارفرمایان این امکان را می‌دهد که استعدادهای واقعی کاندیداها را در محیط‌های کاری شبیه‌سازی شده مشاهده کنند. این فرآیند به کشف توانایی‌های نهفته و ارزیابی دقیق‌تر مهارت‌های کاندیداها کمک می‌کند، که ممکن است در مصاحبه‌های سنتی نادیده گرفته شوند.',
    },
    {
      id: 17,
      key: '17',
      title: '17. آیا OBS  برای مشاغل خاصی مانند پزشکی یا مهندسی مناسب است؟',
      content:
        'بله، OBS  برای طیف گسترده‌ای از مشاغل از جمله پزشکی، مهندسی، تکنولوژی اطلاعات، و بسیاری دیگر مناسب است. شبیه‌سازی‌های ما قابل تنظیم هستند تا به نیازهای خاص هر شغل پاسخ دهند و می‌توانند شرایط واقعی کاری را با دقت بالا شبیه‌سازی کنند.',
    },
    {
      id: 18,
      key: '18',
      title: '18. آیا OBS  دارای قابلیت‌های گزارش‌دهی و تحلیل است؟',
      content:
        'بله، OBS  دارای قابلیت‌های شخصی سازی شده گزارش‌دهی و تحلیل است که به کارفرمایان امکان می‌دهد تا داده‌های جمع‌آوری شده از فرآیندهای تحلیل و ارزیابی شبیه‌سازی شغلی توسط "سرپرست ها" را بررسی و تحلیل کنند. این اطلاعات می‌توانند برای بهبود مستمر فرآیندهای استخدام و توسعه نیروی انسانی استفاده شوند.',
    },
    {
      id: 19,
      key: '19',
      title: '19. چگونه می‌توانم مهارت های خودم را بسنجم؟',
      content:
        'ماهیت عملیاتی OBS، مبتنی بر مسیر خودآموزی و خودارزیابی است. حال آن که با هدف ارائه ی تجربه ی کاربری عمیق تر و آموزنده تر، این پلتفرم امکان ارزیابی توسط سرپرست را برای کاربران فراهم آورده است. شما می توانید با انتخاب گزینه ی "ارزیابی توسط سرپرست"، نسبت به عملکرد و مهارت های خود، گزارش اختصاصی دریافت کنید. احصای مهارت های شما در مسیر شبیه سازی شغل ها، موجب ثبت و امتیازدهی آن مهارت ها در قسمت پروفایل کاربری خواهد شد.',
    },
    {
      id: 20,
      key: '20',
      title: '20. آیا OBS  برنامه‌های آموزشی برای آماده‌سازی کارفرمایان و منابع انسانی دارد؟',
      content:
        'بله، OBS با همکاری آکادمی نیتک، دوره‌های آموزشی مختلفی را برای کارفرمایان و متخصصان منابع انسانی ارائه می‌دهد تا آن‌ها را با بهترین شیوه‌های استفاده از شبیه‌سازی شغلی آشنا کند. این دوره‌ها شامل آموزش‌های عملی، وبینارها و کارگاه‌های تخصصی هستند که به طور مداوم به‌روزرسانی می‌شوند تا آخرین تحولات و نوآوری‌ها را پوشش دهند.',
    },
  ]

  return (
    <section className="pt-16">
      <IntroHeader
        desktopHeight={321}
        mobileHeight={252}
        url={'/images/questions-header.webp'}
      >
        <div className="text-text-dark text-4xl font-bold leading-[4rem] md:leading-10">سوالات متدوال</div>
        <div className="text-text-dark text-xl align-text-center mt-6 mb-9">به تمامی سوالات شما پاسخ داده شده است</div>
      </IntroHeader>
      <div className="container py-16">
        <Accordion
          contentIsHtml
          hideNavigation
          hideStartContent
          showDivider
          accordionData={questions}
          contentClassName="!text-text-dark pb-0 pt-2 text-base max-w-[95%]"
          defaultSelectedKeys={['']}
          indicator={
            <div className="size-[30px] rounded-full flex items-center justify-center border border-primary rotate-180">
              <AngleLeftIcon className="size-5 text-primary" />
            </div>
          }
          page="questions"
          titleClassName="!text-text !text-medium font-normal"
          triggerClassName="p-0"
        />
      </div>
    </section>
  )
}

export default Questions
